[
    {
        "id": "botanybazaar",
        "title": "BotanyBazaar",
        "shortText": "This website was done as a Graded Assignment Project. This would be an online store called BotanyBazaarSG. This online shop allows local farmers and planters to display and sell their plants for consumers to consume or purchase for aesthetic purposes.",
        "img": "botany1.jpeg",
        "tags": ["Web Development"],
        "summary": ["This would be an online store called BotanyBazaarSG. This online shop allows local farmers and planters to display and sell their plants for consumers to consume or purchase for aesthetic purposes. Farmers would be able to sell locally grown veggies like cabbage and lettuce. Casual and seasonal planters, on the other hand, can sell their plants, such as the gorgeous orchids they have grown.", "The purpose of this app is to promote local goods and give clients fresher, sustainably sourced produce. Based on Singapore's Sustainable Development Goals, this would enable us to address some problems. By encouraging locally produced and seasonal products, the platform helps to minimize the carbon footprint of food transportation which contributes to SDG 13 (Climate Action)."],
        "technologies": ["CSS", "Node.Js", "Express JS", "phpMyAdmin", "MySQL"],
        "features": ["The listing page allows suppliers to showcase their brand and specify their supplier type (e.g., FloweryHobs). Also for them to include product descriptions, names, prices, quantities, and photographs, while categorizing their offerings.", "The Discussion Page allows users to create posts about issues related to plants and vegetables, fostering community interaction among local farmers, planters, and curious visitors.", "The Contact Page will provide users with a convenient way to reach us. It will include social media links and essential contact information."],
        "targetAudience": "The intended audience for this online web application is Singaporeans. Locals who wish to eat fresher vegetables and support local producers. It is also for local farmers who want to market their locally produced vegetables.",
        "challenges": ["The most significant challenge I encountered was implementing the login feature for the website. It was crucial to distinguish between suppliers and buyers, as each group has different functionalities and permissions."],
        "learnings": ["Technical Skills: I learned how to create databases for the backend using SQL and phpMyAdmin.", "Technical Skills: I learned to use Express.js, a flexible Node.js web application framework that simplifies building server-side applications."],
        "futureImprovements": ["A feature I would like to implement is enabling users to make actual purchases.", "Automated Email Reply: I believe this would be great to establish credibility with the customer.", "Report Button: This added function is critical so that posts that are reported can be temporarily removed for moderators to filter."],
        "role": "Developed the entire website: Both the Frontend and Backend"
    },
    {
        "id": "beleaf",
        "title": "BeLeaf Mobile Application",
        "shortText": "My team and I created this app during the BrainHack 2024 Code_Exp Competition. We created an AI-powered image recognition for accurate sorting, to reduce contamination and promote responsible disposal.",
        "img": "beleaf2.jpeg",
        "tags": ["Mobile Development", "Artificial Intelligence"],
        "summary": ["Beleaf is an app that determines recyclables and non-recyclables, using an AI Recognition System to scan and identify objects. It also provides users with updated bin capacity so they do not need to spend energy and time transporting recyclables when the bins are full.", "Beleaf also allows users to earn points for recycling products and completing challenges. If you reach a certain number of points, you can earn vouchers."],
        "technologies": ["React Native", "CSS", "Amazon Web Service: Amazon Rekognition Image", "Amazon Location SDK", "Amazon Cognito", "Amazon Pinpoint"],
        "features": ["Recyclables Detection: Uses AI scanning function to detect which category an item falls into.", "Smart Bin Locator: Integrates GPS map service to help in locating the smart bins.", "AI Prompt to Repurpose: Users will be prompted to repurpose scanned objects for donation or to wash unclean recyclables.", "Bin Capacity Sensor Indicator: Users can view the remaining capacity of each bin.", "Rewards Redemption: Users will be able to earn points for recycling items correctly."],
        "targetAudience": "Households who wants to recycle (consumers), they are confused about what and how to recycle the items. We created a solution which has an AI-powered image recognition for accurate sorting.",
        "challenges": ["As a team, I believe one of our biggest obstacles is that this is our first competition. Most of us had no prior experience with Amazon Web Services or its tools.", "As an individual, I believe one of the most difficult challenges was attempting to get the AI Rekognition System to operate.", "As the team leader, I suppose another challenge I had was the deadline."],
        "learnings": ["Technical Skills: I learned how to code in React and React Native after creating this mobile application.", "Technical Skills: I learnt how to use GitHub to collaborate and share code.", "Soft Skills: I learned how to prioritize which features and requirements are necessary for the app and which are not."],
        "futureImprovements": ["We plan to have a community feature which allows people to share their recycling stories online.", "A Streak Tracker which encourages users to interact with the app by monitoring days of completed activity."],
        "role": "Team Leader, AWS AI Rekognition System Implementation",
        "videoId": "iVGHMjnY-wQ"
    },
    {
        "id": "careerxplorer",
        "title": "Career Xplorer",
        "shortText": "My team and I created this website during the GovTech GeekOut 2024 Bootcamp to support Singaporean students in exploring their interests and developing their passions.",
        "img": "career1.jpeg",
        "tags": ["Web Development", "Artificial Intelligence"],
        "summary": ["The problem Statement that we were tackling is 'How might we support Singaporean students in exploring their interests and developing their passions so that they are able to make informed choices for their future careers?'", "As a team, we then created Career Xplorer, a one-stop, consolidated platform for Singaporean Students to explore their passions and obtain relevant and comprehensive information regarding their possible career pathways."],
        "technologies": ["React", "CSS", "HTML", "Open AI"],
        "features": ["User-Friendly Interface, Easy to Navigate", "A Career Quiz to find out what industry best suits the user.", "Comprehensive Information about Different Industries and Job Roles", "Accessible Online Platform"],
        "targetAudience": "The target audience is Singaporean students, specifically those aged 14 to 18. We found two points of pain: they are incredibly busy and do not have the time to conduct research, and there are no centralized resources for them.",
        "challenges": ["As a team, I believe the problem here was time. This was a 25-hour hackathon.", "As an individual, my biggest challenge was building the front end with React, especially since I had limited experience at the time."],
        "learnings": ["Technical Skills: I learned how to code in React more effectively.", "Technical Skills: I also learned the concept of web scraping and how OpenAI can help filter and consolidate information.", "Soft Skills: I gained experience working with a diverse team."],
        "futureImprovements": ["One future upgrade we'd want to make is to add real-time web scrapping.", "Personally, I believe one potential change I might do would be to ensure that users have access to suitable mentors."],
        "role": "Developed the Frontend of the website using React",
        "videoId": "edPVC8S88mw"
    },
    {
        "id": "stickernamecard",
        "title": "Personalised Designed Stickers and Name Card",
        "shortText": "This is two design project that I did for my Graded Assignment Project. Both designs have the identity of a Christian Developer, and I incorporate designs that represent both identity in my faith and my work as a developer.",
        "img": "designGA1.jpeg",
        "tags": ["Design"],
        "summary": ["During the process of creating the name card and sticker design, we were supposed to come up with an identity. The identity I chose is a Christian Developer, as it reflects my passion for coding and my faith, which influences both my work and life as a developer."],
        "tools": ["Adobe Photoshop", "Adobe Illustrator"],
        "role": "Designer - Created Name Card and Sticker Pack Design"
    },
    {
        "id": "lostresearcher",
        "title": "The Lost Researcher: Escape Back to Earth",
        "shortText": "This VR Game was done as a Graded Assignment Project. In this VR escape room game, players are immersed in a randomly generated parallel universe, where they must solve puzzles to escape.",
        "img": "vr1.jpeg",
        "tags": ["Immersive Technologies", "Design"],
        "summary": ["The escape room game is set in a parallel universe, where the player must solve puzzles to escape three distinct, generated universes. Each universe has a unique theme: a futuristic spaceship setting, an 'end of the world' scenario with zombies, and a fantasy world with chemical potions and witches."],
        "technologies": ["Unity: ProBuilder Tools", "Unity Scripts: C#"],
        "features": ["Diverse Themes: The escape room features three distinct themes: futuristic, 'end of the world,' and fantasy.", "Detailed Instructions: At the start of each room in the escape room, clear guidelines will be provided.", "In-game Audio: The game will feature immersive in-game audio that aligns with the theme of each universe.", "Unique Puzzles: Each universe features unique puzzles based on its theme."],
        "targetAudience": "The game is designed for puzzle solvers and can be played solo or with a parent guiding children through the challenges.",
        "challenges": ["One of the main challenges I faced was working with Unity and C# for the first time.", "The biggest challenge I faced was figuring out how to make the player teleport between the three universes."],
        "learnings": ["Technical Skills: I learn how to write C# scripts to ensure the puzzles function correctly.", "Technical Skills: I learned how to import assets into Unity and use them effectively."],
        "futureImprovements": ["A potential future improvement is to create a starting page with a narrator.", "Another improvement I plan to make is to enhance the realism of my rooms and introduce more challenging puzzles.", "I also plan to improve the user experience by allowing players to click on an object to view the instructions."],
        "role": "Developed the entire VR Escape Room: Did the Game Design Document, Did the designing of the rooms and puzzles.",
        "videoId": "SZPw69nsuFc"
    },
    {
        "id": "booklistapp",
        "title": "Book List Mobile App",
        "shortText": "This app was created for one of my C346 lesson submissions, where I learned how to add, edit, and delete items. I developed a book list mobile app because I'm an avid reader.",
        "img": "book.png",
        "tags": ["Mobile Development"],
        "summary": ["This mobile app contains a list that shows three categories: Books I have read, Books I want to read, and Books I am currently reading. The books in the list accurately reflect my own collection."],
        "technologies": ["React Native", "CSS"],
        "features": ["The book list is organized into three sections: 'Books I Have Read,' 'Books I Want to Read,' and 'Books I Am Currently Reading.'", "Users can add new books to any of the three sections", "The app also allows users to update the information for any existing books.", "In addition, users can remove books from the list at any time."],
        "futureImprovements": ["Provide statistics such as total books read, average rating, reading habits, genres preferred.", "Let users rate each book they've read with a star rating system."],
        "role": "Developed the entire Mobile App",
        "videoId": "P59Y30TEhrc"
    },
    {
        "id": "journalapp",
        "title": "Journal Mobile App",
        "shortText": "This app was recently completed as part of my Continuous Assignment C346 Project. I chose to create a journal app because journaling is something that is very meaningful to me.",
        "img": "journalapp.png",
        "tags": ["Mobile Development"],
        "summary": ["This is a journal mobile app that features four emotional sections, allowing users to record their feelings at any time. The app is designed to help users capture and organize their thoughts based on different emotions."],
        "technologies": ["React Native", "CSS"],
        "features": ["Add Journal Entries for Different Moods: Users can create new journal entries under four moods: Upset, Excited, Sad, and Happy.", "View, Edit, or Delete Mood-Based Entries: Each section displays a collection of entries specific to that mood.", "Journal Summary Analytics: A main screen button displays a summary of the user's total journal entries.", "Reflection Question Prompts: A dedicated page offers mood-based reflection questions."],
        "challenges": ["One of the main challenges I encountered was that my data source initially did not allow editing or deleting."],
        "futureImprovements": ["Custom Reflection Prompts: Allow users to add their own reflection questions.", "Mood-based Insights: Provide personalized insights based on the user's entries."],
        "role": "Developed the entire Mobile App",
        "videoId": "71gsrGjiue4"
    },
    {
        "id": "travelapp",
        "title": "Travel List Web App",
        "shortText": "This app was recently completed as part of my Continuous Assignment C219 Project. It is a travel list app that allows users to add items they want to pack.",
        "img": "travelapp.png",
        "tags": ["Web Development"],
        "summary": ["This travel list app is designed to help users efficiently manage their packing lists by allowing them to add items, mark them as packed, and remove them as needed."],
        "technologies": ["React", "CSS"],
        "features": ["Add Items into Packing List: Users can add new items to their packing list, specifying details like quantity and item.", "Mark Items as Packed: Users can easily mark items as packed by toggling a checkbox.", "Delete Items: Users can remove items from the list at any time.", "Track Packing Progress: A dynamic footer displays the percentage of packed items."],
        "futureImprovements": ["Create Packing History: Keep track of past packing lists for future reference.", "Enhance the app by introducing multiple pages with customizable templates for different destinations."],
        "liveLink": "https://travel-list-app-amelia.vercel.app/",
        "role": "Developed the entire Web App",
        "videoId": "RO4C_aN7bvY"
    },
    {
        "id": "focuscrew",
        "title": "Focus Crew High Fidelity Wireframe",
        "shortText": "This wireframe was completed as part of my Continuous Assignment C218 Project. It is for a study mentorship app, where students or individuals who want to learn can book peers to study with or mentors for consulting.",
        "img": "focus.png",
        "tags": ["Design"],
        "summary": ["FocusCrew assists by matching students with peer study partners or mentors based on their topic knowledge, learning preferences, and availability."],
        "technologies": ["Figma"],
        "role": "Completed wireframe design including Site Map, Low Fidelity Wireframe, and High Fidelity Wireframe",
        "videoId": "QLoZ_B_Scmg"
    },
    {
        "id": "styleshop",
        "title": "StyleShop UI Kit and High Fidelity Wireframe",
        "shortText": "StyleShop is a wireframe I created as part of the Continuous Assignment Requirement for C218. StyleShop is an e-commerce platform that sells clothing, shoes, and other items.",
        "img": "style.png",
        "tags": ["Design"],
        "summary": ["To provide a user-friendly shopping platform offering a diverse selection of fashion and lifestyle products, including clothing, accessories, and more, tailored to meet the needs of modern shoppers"],
        "technologies": ["Figma"],
        "role": "Created comprehensive UI Kit and applied it to High Fidelity Wireframe",
        "videoId": "6xErlBigs9w"
    },
    {
        "id": "disney",
        "title": "Disney Movie Finder",
        "shortText": "I created an app called Disney Movie Finder, which fetches data from an API containing information about various disney movies.",
        "img": "disney1.png",
        "tags": ["Mobile Development"],
        "summary": ["I developed an app called Disney Movie Finder that fetches data from an API containing details about various movies. The app displays essential information such as the title, rating, and duration of each movie in an organized list format."],
        "technologies": ["React Native", "CSS", "MySafeInfo API"],
        "features": ["Movie Search: Search for Disney movies by title to quickly find what you're looking for.", "Movie List: Display a list of movies with details like title, rating, and duration.", "Sorting by Rating Category: Sort the movie list based on rating categories (e.g., G, PG, PG-13, R)."],
        "futureImprovements": ["Favorite Movies: Allow users to mark their favorite movies and create a custom list of top picks.", "Sorting by Duration: Allow users to sort the movie list by duration."],
        "role": "Developed the entire Mobile App",
        "videoId": "0qfMZgK-GOg"
    }
]
