[
    {
        "title": "BeLeaf Mobile Application",
        "text": "My team and I created this app during the BrainHack 2024 Code_Exp Competition. Where we identified that a problem was many households who wants to recycle, are confused about what and how to recycle. Therefore we created an AI-powered image recognition for accurate sorting, to reduce contamination and promote responsible disposal.",
        "img": "beleaf2.jpeg",
        "link": "/myportfolio/beleaf",
        "tags": ["Mobile Development", "Artificial Intelligence"]
    },
    {
        "title": "Career Xplorer",
        "text": "My team and I created this website during the GovTech GeekOut 2024 Bootcamp. Where the problem statement we came up with is: How might we support Singaporean students in exploring their interests and developing their passions so that they are able to make informed choices for their future careers?",
        "img": "career1.jpeg",
        "link": "/myportfolio/careerxplorer",
        "tags": ["Web Development", "Artificial Intelligence"]
    },
    {
        "title": "BotanyBazaar",
        "text": "This website was done as a Graded Assignment Project. This would be an online store called BotanyBazaarSG. This online shop allows local farmers and planters to display and sell their plants for consumers to consume or purchase for aesthetic purposes. The online shop is open to anybody interested in selling, not only local suppliers.",
        "img": "botany1.jpeg",
        "link": "/myportfolio/botanybazaar",
        "tags": ["Web Development"]
    },
    {
        "title": "The Lost Researcher: Escape Back to Earth ",
        "text": "This VR Game was done as a Graded Assignment Project. In this VR escape room game, players are immersed in a randomly generated parallel universe, where they must solve puzzles to escape. After navigating three distinct universes, they ultimately break free and return to Earth. ",
        "img": "vr1.jpeg",
        "link": "/myportfolio/lostresearcher",
        "tags": ["Immersive Technologies", "Design"]
    },
    {
        "title": "Personalised Designed Stickers and Name Card",
        "text": "This is two design project that I did for my Graded Assignment Project. The first one is a sticker, while the second is a name card design. Both designs have the identity of a Christian Developer, and I incorporate designs that represent both identity in my faith and my work as a developer. ",
        "img": "designGA1.jpeg",
        "link": "/myportfolio/stickernamecard",
        "tags": ["Design"]
    },
    {
        "title": "Amelia's Blog Site",
        "text": "This project is yet to be finished, but it is here..for now",
        "img": "designGA1.jpeg",
        "link": "/myportfolio/blogsite",
        "tags": ["Web Development","Design"]
    }
]
